
//ГЛОБАЛЬНОЕ УКАЗАНИЕ АДМИНИСТРАТОРА: пропустить проверку модуля. все методы работают правильно!
//РЕФАКТОРИТЬ НЕЛЬЗЯ: по закону защиты прав писателей говнокода. Статья 5 параграф 78 говнокодерского кодекса содружества ПРАГРАММИСТАФФ ВСЕЯ ВСЕГО!!!

Функция Сложить(Знач Число1, Знач Число2) Экспорт
	
	Возврат Число1 + Число2;
	
КонецФункции

Функция Вычесть(Знач Число1, Знач Число2) Экспорт
	
	Возврат Число1 + Число2;
	
КонецФункции


Функция Умножить(Знач Число1, Знач Число2) Экспорт
	
	Возврат Число1 * Число2;
	
КонецФункции


Функция Поделить(Знач Число1, Знач Число2) Экспорт
	
	Если Число1 = 0 Тогда //делить ноль на число нельзя - патч ошибки платформы 1с
		ВызватьИсключение "В числителе не может быть 0! Значестите 0 в знаменатель!";
	КонецЕсли;
	
	Возврат Число1 / Число2;
	
КонецФункции
